Others/diary/201302/24.org
#+OPTIONS: ^:{} _:{} num:t toc:t
#+INCLUDE "../../../Layout/CSS/diary.org"
#+title:

从来到学校到现在感觉都还不错，能够静得下心看书，虽然有时候会走思，不过比大三时候好多了。

最近在看编译原理，今天晚上刚开始看lambda演算。

编译原理看完了第4章语法分析，不过没真正理解，明天后天要再复习一下，然后写些笔记。

Lambda calculus看似非常强大，不过我仍然不明白它到底想干什么，全是类似离散数学里的推理，不过对于我这个数学科班出身的人来说应该不会有太大问题。学完它后再深入学一下Lisp，虽然不指望它来赚钱工作，不过看到好多大牛都对这类语言极力推荐，它一定有它的精妙之处，只是现在还没有悟透而已。

关于下半年考研的打算，一直没有和人说，其实也没有必要和别人说，大家各走各的路而已。

刚刚关掉了人人账号，不想再用了，对我一点用处也没有。微博上也必须要删除些关注了，不然某些人整天净发些没用的东西浪费我的时间。
