Others/diary/201302/24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content=""/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-24 23:43:19 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title"></h1>


<link rel="stylesheet" type="text/css" href="../../../Layout/CSS/style.css" />
<style type="text/css" media="screen">
body {
width: 600px;
padding-top: 60px;
}
p{
text-indent: 2em;
}
</style>


<p>
从来到学校到现在感觉都还不错，能够静得下心看书，虽然有时候会走思，不过比大三时候好多了。
</p>
<p>
最近在看编译原理，今天晚上刚开始看lambda演算。
</p>
<p>
编译原理看完了第4章语法分析，不过没真正理解，明天后天要再复习一下，然后写些笔记。
</p>
<p>
Lambda calculus看似非常强大，不过我仍然不明白它到底想干什么，全是类似离散数学里的推理，不过对于我这个数学科班出身的人来说应该不会有太大问题。学完它后再深入学一下Lisp，虽然不指望它来赚钱工作，不过看到好多大牛都对这类语言极力推荐，它一定有它的精妙之处，只是现在还没有悟透而已。
</p>
<p>
关于下半年考研的打算，一直没有和人说，其实也没有必要和别人说，大家各走各的路而已。
</p>
<p>
刚刚关掉了人人账号，不想再用了，对我一点用处也没有。微博上也必须要删除些关注了，不然某些人整天净发些没用的东西浪费我的时间。
</p></div>

</body>
</html>
